espressif/esp-idf/components/soc/esp32c2/register/soc/apb_saradc_reg.h
/** APB_SARADC_SAR1_STATUS_REG register
 *  register description
 */
#define APB_SARADC_SAR1_STATUS_REG (DR_REG_APB_SARADC_BASE + 0x10)
/** APB_SARADC_SAR1_STATUS : RO; bitpos: [31:0]; default: 0;
 *  Need add description
 */
#define APB_SARADC_SAR1_STATUS    0xFFFFFFFFU
#define APB_SARADC_SAR1_STATUS_M  (APB_SARADC_SAR1_STATUS_V << APB_SARADC_SAR1_STATUS_S)
#define APB_SARADC_SAR1_STATUS_V  0xFFFFFFFFU
#define APB_SARADC_SAR1_STATUS_S  0

/** APB_SARADC_SAR2_STATUS_REG register
 *  register description
 */
#define APB_SARADC_SAR2_STATUS_REG (DR_REG_APB_SARADC_BASE + 0x14)
/** APB_SARADC_SAR2_STATUS : RO; bitpos: [31:0]; default: 0;
 *  Need add description
 */
#define APB_SARADC_SAR2_STATUS    0xFFFFFFFFU
#define APB_SARADC_SAR2_STATUS_M  (APB_SARADC_SAR2_STATUS_V << APB_SARADC_SAR2_STATUS_S)
#define APB_SARADC_SAR2_STATUS_V  0xFFFFFFFFU
#define APB_SARADC_SAR2_STATUS_S  0

/** APB_SARADC_SAR_PATT_TAB1_REG register
 *  register description
 */
#define APB_SARADC_SAR_PATT_TAB1_REG (DR_REG_APB_SARADC_BASE + 0x18)
/** APB_SARADC_SAR_PATT_TAB1 : R/W; bitpos: [23:0]; default: 16777215;
 *  item 0 ~ 3 for pattern table 1 (each item one byte)
 */
#define APB_SARADC_SAR_PATT_TAB1    0x00FFFFFFU
#define APB_SARADC_SAR_PATT_TAB1_M  (APB_SARADC_SAR_PATT_TAB1_V << APB_SARADC_SAR_PATT_TAB1_S)
#define APB_SARADC_SAR_PATT_TAB1_V  0x00FFFFFFU
#define APB_SARADC_SAR_PATT_TAB1_S  0

/** APB_SARADC_SAR_PATT_TAB2_REG register
 *  register description
 */
#define APB_SARADC_SAR_PATT_TAB2_REG (DR_REG_APB_SARADC_BASE + 0x1c)
/** APB_SARADC_SAR_PATT_TAB2 : R/W; bitpos: [23:0]; default: 16777215;
 *  Item 4 ~ 7 for pattern table 1 (each item one byte)
 */
#define APB_SARADC_SAR_PATT_TAB2    0x00FFFFFFU
#define APB_SARADC_SAR_PATT_TAB2_M  (APB_SARADC_SAR_PATT_TAB2_V << APB_SARADC_SAR_PATT_TAB2_S)
#define APB_SARADC_SAR_PATT_TAB2_V  0x00FFFFFFU
#define APB_SARADC_SAR_PATT_TAB2_S  0

/** APB_SARADC_ONETIME_SAMPLE_REG register
 *  register description
 */
#define APB_SARADC_ONETIME_SAMPLE_REG (DR_REG_APB_SARADC_BASE + 0x20)
/** APB_SARADC_ONETIME_ATTEN : R/W; bitpos: [24:23]; default: 0;
 *  Need add description
 */
#define APB_SARADC_ONETIME_ATTEN    0x00000003U
#define APB_SARADC_ONETIME_ATTEN_M  (APB_SARADC_ONETIME_ATTEN_V << APB_SARADC_ONETIME_ATTEN_S)
#define APB_SARADC_ONETIME_ATTEN_V  0x00000003U
#define APB_SARADC_ONETIME_ATTEN_S  23
/** APB_SARADC_ONETIME_CHANNEL : R/W; bitpos: [28:25]; default: 13;
 *  Need add description
 */
#define APB_SARADC_ONETIME_CHANNEL    0x0000000FU
#define APB_SARADC_ONETIME_CHANNEL_M  (APB_SARADC_ONETIME_CHANNEL_V << APB_SARADC_ONETIME_CHANNEL_S)
#define APB_SARADC_ONETIME_CHANNEL_V  0x0000000FU
#define APB_SARADC_ONETIME_CHANNEL_S  25
/** APB_SARADC_ONETIME_START : R/W; bitpos: [29]; default: 0;
 *  Need add description
 */
#define APB_SARADC_ONETIME_START    (BIT(29))
#define APB_SARADC_ONETIME_START_M  (APB_SARADC_ONETIME_START_V << APB_SARADC_ONETIME_START_S)
#define APB_SARADC_ONETIME_START_V  0x00000001U
#define APB_SARADC_ONETIME_START_S  29
/** APB_SARADC2_ONETIME_SAMPLE : R/W; bitpos: [30]; default: 0;
 *  Need add description
 */
#define APB_SARADC2_ONETIME_SAMPLE    (BIT(30))
#define APB_SARADC2_ONETIME_SAMPLE_M  (APB_SARADC2_ONETIME_SAMPLE_V << APB_SARADC2_ONETIME_SAMPLE_S)
#define APB_SARADC2_ONETIME_SAMPLE_V  0x00000001U
#define APB_SARADC2_ONETIME_SAMPLE_S  30
/** APB_SARADC1_ONETIME_SAMPLE : R/W; bitpos: [31]; default: 0;
 *  Need add description
 */
#define APB_SARADC1_ONETIME_SAMPLE    (BIT(31))
#define APB_SARADC1_ONETIME_SAMPLE_M  (APB_SARADC1_ONETIME_SAMPLE_V << APB_SARADC1_ONETIME_SAMPLE_S)
#define APB_SARADC1_ONETIME_SAMPLE_V  0x00000001U
#define APB_SARADC1_ONETIME_SAMPLE_S  31

/** APB_SARADC_APB_ADC_ARB_CTRL_REG register
 *  register description
 */
#define APB_SARADC_APB_ADC_ARB_CTRL_REG (DR_REG_APB_SARADC_BASE + 0x24)
/** APB_SARADC_ADC_ARB_APB_FORCE : R/W; bitpos: [2]; default: 0;
 *  adc2 arbiter force to enableapb controller
 */
#define APB_SARADC_ADC_ARB_APB_FORCE    (BIT(2))
#define APB_SARADC_ADC_ARB_APB_FORCE_M  (APB_SARADC_ADC_ARB_APB_FORCE_V << APB_SARADC_ADC_ARB_APB_FORCE_S)
#define APB_SARADC_ADC_ARB_APB_FORCE_V  0x00000001U
#define APB_SARADC_ADC_ARB_APB_FORCE_S  2
/** APB_SARADC_ADC_ARB_RTC_FORCE : R/W; bitpos: [3]; default: 0;
 *  adc2 arbiter force to enable rtc controller
 */
#define APB_SARADC_ADC_ARB_RTC_FORCE    (BIT(3))
#define APB_SARADC_ADC_ARB_RTC_FORCE_M  (APB_SARADC_ADC_ARB_RTC_FORCE_V << APB_SARADC_ADC_ARB_RTC_FORCE_S)
#define APB_SARADC_ADC_ARB_RTC_FORCE_V  0x00000001U
#define APB_SARADC_ADC_ARB_RTC_FORCE_S  3
/** APB_SARADC_ADC_ARB_WIFI_FORCE : R/W; bitpos: [4]; default: 0;
 *  adc2 arbiter force to enable wifi controller
 */
#define APB_SARADC_ADC_ARB_WIFI_FORCE    (BIT(4))
#define APB_SARADC_ADC_ARB_WIFI_FORCE_M  (APB_SARADC_ADC_ARB_WIFI_FORCE_V << APB_SARADC_ADC_ARB_WIFI_FORCE_S)
#define APB_SARADC_ADC_ARB_WIFI_FORCE_V  0x00000001U
#define APB_SARADC_ADC_ARB_WIFI_FORCE_S  4
/** APB_SARADC_ADC_ARB_GRANT_FORCE : R/W; bitpos: [5]; default: 0;
 *  adc2 arbiter force grant
 */
#define APB_SARADC_ADC_ARB_GRANT_FORCE    (BIT(5))
#define APB_SARADC_ADC_ARB_GRANT_FORCE_M  (APB_SARADC_ADC_ARB_GRANT_FORCE_V << APB_SARADC_ADC_ARB_GRANT_FORCE_S)
#define APB_SARADC_ADC_ARB_GRANT_FORCE_V  0x00000001U
#define APB_SARADC_ADC_ARB_GRANT_FORCE_S  5
/** APB_SARADC_ADC_ARB_APB_PRIORITY : R/W; bitpos: [7:6]; default: 0;
 *  Set adc2 arbiterapb priority
 */
#define APB_SARADC_ADC_ARB_APB_PRIORITY    0x00000003U
#define APB_SARADC_ADC_ARB_APB_PRIORITY_M  (APB_SARADC_ADC_ARB_APB_PRIORITY_V << APB_SARADC_ADC_ARB_APB_PRIORITY_S)
#define APB_SARADC_ADC_ARB_APB_PRIORITY_V  0x00000003U
#define APB_SARADC_ADC_ARB_APB_PRIORITY_S  6
/** APB_SARADC_ADC_ARB_RTC_PRIORITY : R/W; bitpos: [9:8]; default: 1;
 *  Set adc2 arbiter rtc priority
 */
#define APB_SARADC_ADC_ARB_RTC_PRIORITY    0x00000003U
#define APB_SARADC_ADC_ARB_RTC_PRIORITY_M  (APB_SARADC_ADC_ARB_RTC_PRIORITY_V << APB_SARADC_ADC_ARB_RTC_PRIORITY_S)
#define APB_SARADC_ADC_ARB_RTC_PRIORITY_V  0x00000003U
#define APB_SARADC_ADC_ARB_RTC_PRIORITY_S  8
/** APB_SARADC_ADC_ARB_WIFI_PRIORITY : R/W; bitpos: [11:10]; default: 2;
 *  Set adc2 arbiter wifi priority
 */
#define APB_SARADC_ADC_ARB_WIFI_PRIORITY    0x00000003U
#define APB_SARADC_ADC_ARB_WIFI_PRIORITY_M  (APB_SARADC_ADC_ARB_WIFI_PRIORITY_V << APB_SARADC_ADC_ARB_WIFI_PRIORITY_S)
#define APB_SARADC_ADC_ARB_WIFI_PRIORITY_V  0x00000003U
#define APB_SARADC_ADC_ARB_WIFI_PRIORITY_S  10
/** APB_SARADC_ADC_ARB_FIX_PRIORITY : R/W; bitpos: [12]; default: 0;
 *  adc2 arbiter uses fixed priority
 */
#define APB_SARADC_ADC_ARB_FIX_PRIORITY    (BIT(12))
#define APB_SARADC_ADC_ARB_FIX_PRIORITY_M  (APB_SARADC_ADC_ARB_FIX_PRIORITY_V << APB_SARADC_ADC_ARB_FIX_PRIORITY_S)
#define APB_SARADC_ADC_ARB_FIX_PRIORITY_V  0x00000001U
#define APB_SARADC_ADC_ARB_FIX_PRIORITY_S  12

