espressif/esp-idf/components/soc/esp32c2/register/soc/apb_saradc_reg.h
/** APB_SARADC_INT_RAW_REG register
 *  register description
 */
#define APB_SARADC_INT_RAW_REG (DR_REG_APB_SARADC_BASE + 0x44)
/** APB_SARADC_THRES1_LOW_INT_RAW : RO; bitpos: [26]; default: 0;
 *  Need add description
 */
#define APB_SARADC_THRES1_LOW_INT_RAW    (BIT(26))
#define APB_SARADC_THRES1_LOW_INT_RAW_M  (APB_SARADC_THRES1_LOW_INT_RAW_V << APB_SARADC_THRES1_LOW_INT_RAW_S)
#define APB_SARADC_THRES1_LOW_INT_RAW_V  0x00000001U
#define APB_SARADC_THRES1_LOW_INT_RAW_S  26
/** APB_SARADC_THRES0_LOW_INT_RAW : RO; bitpos: [27]; default: 0;
 *  Need add description
 */
#define APB_SARADC_THRES0_LOW_INT_RAW    (BIT(27))
#define APB_SARADC_THRES0_LOW_INT_RAW_M  (APB_SARADC_THRES0_LOW_INT_RAW_V << APB_SARADC_THRES0_LOW_INT_RAW_S)
#define APB_SARADC_THRES0_LOW_INT_RAW_V  0x00000001U
#define APB_SARADC_THRES0_LOW_INT_RAW_S  27
/** APB_SARADC_THRES1_HIGH_INT_RAW : RO; bitpos: [28]; default: 0;
 *  Need add description
 */
#define APB_SARADC_THRES1_HIGH_INT_RAW    (BIT(28))
#define APB_SARADC_THRES1_HIGH_INT_RAW_M  (APB_SARADC_THRES1_HIGH_INT_RAW_V << APB_SARADC_THRES1_HIGH_INT_RAW_S)
#define APB_SARADC_THRES1_HIGH_INT_RAW_V  0x00000001U
#define APB_SARADC_THRES1_HIGH_INT_RAW_S  28
/** APB_SARADC_THRES0_HIGH_INT_RAW : RO; bitpos: [29]; default: 0;
 *  Need add description
 */
#define APB_SARADC_THRES0_HIGH_INT_RAW    (BIT(29))
#define APB_SARADC_THRES0_HIGH_INT_RAW_M  (APB_SARADC_THRES0_HIGH_INT_RAW_V << APB_SARADC_THRES0_HIGH_INT_RAW_S)
#define APB_SARADC_THRES0_HIGH_INT_RAW_V  0x00000001U
#define APB_SARADC_THRES0_HIGH_INT_RAW_S  29
/** APB_SARADC2_DONE_INT_RAW : RO; bitpos: [30]; default: 0;
 *  Need add description
 */
#define APB_SARADC2_DONE_INT_RAW    (BIT(30))
#define APB_SARADC2_DONE_INT_RAW_M  (APB_SARADC2_DONE_INT_RAW_V << APB_SARADC2_DONE_INT_RAW_S)
#define APB_SARADC2_DONE_INT_RAW_V  0x00000001U
#define APB_SARADC2_DONE_INT_RAW_S  30
/** APB_SARADC1_DONE_INT_RAW : RO; bitpos: [31]; default: 0;
 *  Need add description
 */
#define APB_SARADC1_DONE_INT_RAW    (BIT(31))
#define APB_SARADC1_DONE_INT_RAW_M  (APB_SARADC1_DONE_INT_RAW_V << APB_SARADC1_DONE_INT_RAW_S)
#define APB_SARADC1_DONE_INT_RAW_V  0x00000001U
#define APB_SARADC1_DONE_INT_RAW_S  31

/** APB_SARADC_INT_ST_REG register
 *  register description
 */
#define APB_SARADC_INT_ST_REG (DR_REG_APB_SARADC_BASE + 0x48)
/** APB_SARADC_THRES1_LOW_INT_ST : RO; bitpos: [26]; default: 0;
 *  Need add description
 */
#define APB_SARADC_THRES1_LOW_INT_ST    (BIT(26))
#define APB_SARADC_THRES1_LOW_INT_ST_M  (APB_SARADC_THRES1_LOW_INT_ST_V << APB_SARADC_THRES1_LOW_INT_ST_S)
#define APB_SARADC_THRES1_LOW_INT_ST_V  0x00000001U
#define APB_SARADC_THRES1_LOW_INT_ST_S  26
/** APB_SARADC_THRES0_LOW_INT_ST : RO; bitpos: [27]; default: 0;
 *  Need add description
 */
#define APB_SARADC_THRES0_LOW_INT_ST    (BIT(27))
#define APB_SARADC_THRES0_LOW_INT_ST_M  (APB_SARADC_THRES0_LOW_INT_ST_V << APB_SARADC_THRES0_LOW_INT_ST_S)
#define APB_SARADC_THRES0_LOW_INT_ST_V  0x00000001U
#define APB_SARADC_THRES0_LOW_INT_ST_S  27
/** APB_SARADC_THRES1_HIGH_INT_ST : RO; bitpos: [28]; default: 0;
 *  Need add description
 */
#define APB_SARADC_THRES1_HIGH_INT_ST    (BIT(28))
#define APB_SARADC_THRES1_HIGH_INT_ST_M  (APB_SARADC_THRES1_HIGH_INT_ST_V << APB_SARADC_THRES1_HIGH_INT_ST_S)
#define APB_SARADC_THRES1_HIGH_INT_ST_V  0x00000001U
#define APB_SARADC_THRES1_HIGH_INT_ST_S  28
/** APB_SARADC_THRES0_HIGH_INT_ST : RO; bitpos: [29]; default: 0;
 *  Need add description
 */
#define APB_SARADC_THRES0_HIGH_INT_ST    (BIT(29))
#define APB_SARADC_THRES0_HIGH_INT_ST_M  (APB_SARADC_THRES0_HIGH_INT_ST_V << APB_SARADC_THRES0_HIGH_INT_ST_S)
#define APB_SARADC_THRES0_HIGH_INT_ST_V  0x00000001U
#define APB_SARADC_THRES0_HIGH_INT_ST_S  29
/** APB_SARADC2_DONE_INT_ST : RO; bitpos: [30]; default: 0;
 *  Need add description
 */
#define APB_SARADC2_DONE_INT_ST    (BIT(30))
#define APB_SARADC2_DONE_INT_ST_M  (APB_SARADC2_DONE_INT_ST_V << APB_SARADC2_DONE_INT_ST_S)
#define APB_SARADC2_DONE_INT_ST_V  0x00000001U
#define APB_SARADC2_DONE_INT_ST_S  30
/** APB_SARADC1_DONE_INT_ST : RO; bitpos: [31]; default: 0;
 *  Need add description
 */
#define APB_SARADC1_DONE_INT_ST    (BIT(31))
#define APB_SARADC1_DONE_INT_ST_M  (APB_SARADC1_DONE_INT_ST_V << APB_SARADC1_DONE_INT_ST_S)
#define APB_SARADC1_DONE_INT_ST_V  0x00000001U
#define APB_SARADC1_DONE_INT_ST_S  31

/** APB_SARADC_INT_CLR_REG register
 *  register description
 */
#define APB_SARADC_INT_CLR_REG (DR_REG_APB_SARADC_BASE + 0x4c)
/** APB_SARADC_THRES1_LOW_INT_CLR : WO; bitpos: [26]; default: 0;
 *  Need add description
 */
#define APB_SARADC_THRES1_LOW_INT_CLR    (BIT(26))
#define APB_SARADC_THRES1_LOW_INT_CLR_M  (APB_SARADC_THRES1_LOW_INT_CLR_V << APB_SARADC_THRES1_LOW_INT_CLR_S)
#define APB_SARADC_THRES1_LOW_INT_CLR_V  0x00000001U
#define APB_SARADC_THRES1_LOW_INT_CLR_S  26
/** APB_SARADC_THRES0_LOW_INT_CLR : WO; bitpos: [27]; default: 0;
 *  Need add description
 */
#define APB_SARADC_THRES0_LOW_INT_CLR    (BIT(27))
#define APB_SARADC_THRES0_LOW_INT_CLR_M  (APB_SARADC_THRES0_LOW_INT_CLR_V << APB_SARADC_THRES0_LOW_INT_CLR_S)
#define APB_SARADC_THRES0_LOW_INT_CLR_V  0x00000001U
#define APB_SARADC_THRES0_LOW_INT_CLR_S  27
/** APB_SARADC_THRES1_HIGH_INT_CLR : WO; bitpos: [28]; default: 0;
 *  Need add description
 */
#define APB_SARADC_THRES1_HIGH_INT_CLR    (BIT(28))
#define APB_SARADC_THRES1_HIGH_INT_CLR_M  (APB_SARADC_THRES1_HIGH_INT_CLR_V << APB_SARADC_THRES1_HIGH_INT_CLR_S)
#define APB_SARADC_THRES1_HIGH_INT_CLR_V  0x00000001U
#define APB_SARADC_THRES1_HIGH_INT_CLR_S  28
/** APB_SARADC_THRES0_HIGH_INT_CLR : WO; bitpos: [29]; default: 0;
 *  Need add description
 */
#define APB_SARADC_THRES0_HIGH_INT_CLR    (BIT(29))
#define APB_SARADC_THRES0_HIGH_INT_CLR_M  (APB_SARADC_THRES0_HIGH_INT_CLR_V << APB_SARADC_THRES0_HIGH_INT_CLR_S)
#define APB_SARADC_THRES0_HIGH_INT_CLR_V  0x00000001U
#define APB_SARADC_THRES0_HIGH_INT_CLR_S  29
/** APB_SARADC2_DONE_INT_CLR : WO; bitpos: [30]; default: 0;
 *  Need add description
 */
#define APB_SARADC2_DONE_INT_CLR    (BIT(30))
#define APB_SARADC2_DONE_INT_CLR_M  (APB_SARADC2_DONE_INT_CLR_V << APB_SARADC2_DONE_INT_CLR_S)
#define APB_SARADC2_DONE_INT_CLR_V  0x00000001U
#define APB_SARADC2_DONE_INT_CLR_S  30
/** APB_SARADC1_DONE_INT_CLR : WO; bitpos: [31]; default: 0;
 *  Need add description
 */
#define APB_SARADC1_DONE_INT_CLR    (BIT(31))
#define APB_SARADC1_DONE_INT_CLR_M  (APB_SARADC1_DONE_INT_CLR_V << APB_SARADC1_DONE_INT_CLR_S)
#define APB_SARADC1_DONE_INT_CLR_V  0x00000001U
#define APB_SARADC1_DONE_INT_CLR_S  31

/** APB_SARADC_DMA_CONF_REG register
 *  register description
 */
#define APB_SARADC_DMA_CONF_REG (DR_REG_APB_SARADC_BASE + 0x50)
/** APB_SARADC_APB_ADC_EOF_NUM : R/W; bitpos: [15:0]; default: 255;
 *  the dma_in_suc_eof gen when sample cnt = spi_eof_num
 */
#define APB_SARADC_APB_ADC_EOF_NUM    0x0000FFFFU
#define APB_SARADC_APB_ADC_EOF_NUM_M  (APB_SARADC_APB_ADC_EOF_NUM_V << APB_SARADC_APB_ADC_EOF_NUM_S)
#define APB_SARADC_APB_ADC_EOF_NUM_V  0x0000FFFFU
#define APB_SARADC_APB_ADC_EOF_NUM_S  0
/** APB_SARADC_APB_ADC_RESET_FSM : R/W; bitpos: [30]; default: 0;
 *  reset_apb_adc_state
 */
#define APB_SARADC_APB_ADC_RESET_FSM    (BIT(30))
#define APB_SARADC_APB_ADC_RESET_FSM_M  (APB_SARADC_APB_ADC_RESET_FSM_V << APB_SARADC_APB_ADC_RESET_FSM_S)
#define APB_SARADC_APB_ADC_RESET_FSM_V  0x00000001U
#define APB_SARADC_APB_ADC_RESET_FSM_S  30
/** APB_SARADC_APB_ADC_TRANS : R/W; bitpos: [31]; default: 0;
 *  enable apb_adc use spi_dma
 */
#define APB_SARADC_APB_ADC_TRANS    (BIT(31))
#define APB_SARADC_APB_ADC_TRANS_M  (APB_SARADC_APB_ADC_TRANS_V << APB_SARADC_APB_ADC_TRANS_S)
#define APB_SARADC_APB_ADC_TRANS_V  0x00000001U
#define APB_SARADC_APB_ADC_TRANS_S  31

/** APB_SARADC_APB_ADC_CLKM_CONF_REG register
 *  register description
 */
#define APB_SARADC_APB_ADC_CLKM_CONF_REG (DR_REG_APB_SARADC_BASE + 0x54)
/** APB_SARADC_REG_CLKM_DIV_NUM : R/W; bitpos: [7:0]; default: 4;
 *  Integral I2S clock divider value
 */
#define APB_SARADC_REG_CLKM_DIV_NUM    0x000000FFU
#define APB_SARADC_REG_CLKM_DIV_NUM_M  (APB_SARADC_REG_CLKM_DIV_NUM_V << APB_SARADC_REG_CLKM_DIV_NUM_S)
#define APB_SARADC_REG_CLKM_DIV_NUM_V  0x000000FFU
#define APB_SARADC_REG_CLKM_DIV_NUM_S  0
/** APB_SARADC_REG_CLKM_DIV_B : R/W; bitpos: [13:8]; default: 0;
 *  Fractional clock divider numerator value
 */
#define APB_SARADC_REG_CLKM_DIV_B    0x0000003FU
#define APB_SARADC_REG_CLKM_DIV_B_M  (APB_SARADC_REG_CLKM_DIV_B_V << APB_SARADC_REG_CLKM_DIV_B_S)
#define APB_SARADC_REG_CLKM_DIV_B_V  0x0000003FU
#define APB_SARADC_REG_CLKM_DIV_B_S  8
/** APB_SARADC_REG_CLKM_DIV_A : R/W; bitpos: [19:14]; default: 0;
 *  Fractional clock divider denominator value
 */
#define APB_SARADC_REG_CLKM_DIV_A    0x0000003FU
#define APB_SARADC_REG_CLKM_DIV_A_M  (APB_SARADC_REG_CLKM_DIV_A_V << APB_SARADC_REG_CLKM_DIV_A_S)
#define APB_SARADC_REG_CLKM_DIV_A_V  0x0000003FU
#define APB_SARADC_REG_CLKM_DIV_A_S  14
/** APB_SARADC_CLK_EN : R/W; bitpos: [20]; default: 0;
 *  Need add description
 */
#define APB_SARADC_CLK_EN    (BIT(20))
#define APB_SARADC_CLK_EN_M  (APB_SARADC_CLK_EN_V << APB_SARADC_CLK_EN_S)
#define APB_SARADC_CLK_EN_V  0x00000001U
#define APB_SARADC_CLK_EN_S  20
/** APB_SARADC_REG_CLK_SEL : R/W; bitpos: [22:21]; default: 0;
 *  Set this bit to enable clk_apll
 */
#define APB_SARADC_REG_CLK_SEL    0x00000003U
#define APB_SARADC_REG_CLK_SEL_M  (APB_SARADC_REG_CLK_SEL_V << APB_SARADC_REG_CLK_SEL_S)
#define APB_SARADC_REG_CLK_SEL_V  0x00000003U
#define APB_SARADC_REG_CLK_SEL_S  21

