espressif/esp-idf/components/soc/esp32c2/register/soc/apb_saradc_reg.h
/** APB_SARADC_APB_TSENS_CTRL_REG register
 *  register description
 */
#define APB_SARADC_APB_TSENS_CTRL_REG (DR_REG_APB_SARADC_BASE + 0x58)
/** APB_SARADC_REG_TSENS_OUT : RO; bitpos: [7:0]; default: 0;
 *  Need add description
 */
#define APB_SARADC_REG_TSENS_OUT    0x000000FFU
#define APB_SARADC_REG_TSENS_OUT_M  (APB_SARADC_REG_TSENS_OUT_V << APB_SARADC_REG_TSENS_OUT_S)
#define APB_SARADC_REG_TSENS_OUT_V  0x000000FFU
#define APB_SARADC_REG_TSENS_OUT_S  0
/** APB_SARADC_REG_TSENS_IN_INV : R/W; bitpos: [13]; default: 0;
 *  Need add description
 */
#define APB_SARADC_REG_TSENS_IN_INV    (BIT(13))
#define APB_SARADC_REG_TSENS_IN_INV_M  (APB_SARADC_REG_TSENS_IN_INV_V << APB_SARADC_REG_TSENS_IN_INV_S)
#define APB_SARADC_REG_TSENS_IN_INV_V  0x00000001U
#define APB_SARADC_REG_TSENS_IN_INV_S  13
/** APB_SARADC_REG_TSENS_CLK_DIV : R/W; bitpos: [21:14]; default: 6;
 *  Need add description
 */
#define APB_SARADC_REG_TSENS_CLK_DIV    0x000000FFU
#define APB_SARADC_REG_TSENS_CLK_DIV_M  (APB_SARADC_REG_TSENS_CLK_DIV_V << APB_SARADC_REG_TSENS_CLK_DIV_S)
#define APB_SARADC_REG_TSENS_CLK_DIV_V  0x000000FFU
#define APB_SARADC_REG_TSENS_CLK_DIV_S  14
/** APB_SARADC_REG_TSENS_PU : R/W; bitpos: [22]; default: 0;
 *  Need add description
 */
#define APB_SARADC_REG_TSENS_PU    (BIT(22))
#define APB_SARADC_REG_TSENS_PU_M  (APB_SARADC_REG_TSENS_PU_V << APB_SARADC_REG_TSENS_PU_S)
#define APB_SARADC_REG_TSENS_PU_V  0x00000001U
#define APB_SARADC_REG_TSENS_PU_S  22

/** APB_SARADC_APB_TSENS_CTRL2_REG register
 *  register description
 */
#define APB_SARADC_APB_TSENS_CTRL2_REG (DR_REG_APB_SARADC_BASE + 0x5c)
/** APB_SARADC_REG_TSENS_XPD_WAIT : R/W; bitpos: [11:0]; default: 2;
 *  Need add description
 */
#define APB_SARADC_REG_TSENS_XPD_WAIT    0x00000FFFU
#define APB_SARADC_REG_TSENS_XPD_WAIT_M  (APB_SARADC_REG_TSENS_XPD_WAIT_V << APB_SARADC_REG_TSENS_XPD_WAIT_S)
#define APB_SARADC_REG_TSENS_XPD_WAIT_V  0x00000FFFU
#define APB_SARADC_REG_TSENS_XPD_WAIT_S  0
/** APB_SARADC_REG_TSENS_XPD_FORCE : R/W; bitpos: [13:12]; default: 0;
 *  Need add description
 */
#define APB_SARADC_REG_TSENS_XPD_FORCE    0x00000003U
#define APB_SARADC_REG_TSENS_XPD_FORCE_M  (APB_SARADC_REG_TSENS_XPD_FORCE_V << APB_SARADC_REG_TSENS_XPD_FORCE_S)
#define APB_SARADC_REG_TSENS_XPD_FORCE_V  0x00000003U
#define APB_SARADC_REG_TSENS_XPD_FORCE_S  12
/** APB_SARADC_REG_TSENS_CLK_INV : R/W; bitpos: [14]; default: 1;
 *  Need add description
 */
#define APB_SARADC_REG_TSENS_CLK_INV    (BIT(14))
#define APB_SARADC_REG_TSENS_CLK_INV_M  (APB_SARADC_REG_TSENS_CLK_INV_V << APB_SARADC_REG_TSENS_CLK_INV_S)
#define APB_SARADC_REG_TSENS_CLK_INV_V  0x00000001U
#define APB_SARADC_REG_TSENS_CLK_INV_S  14
/** APB_SARADC_TSENS_CLK_SEL : R/W; bitpos: [15]; default: 0;
 *  Need add description
 */
#define APB_SARADC_TSENS_CLK_SEL    (BIT(15))
#define APB_SARADC_TSENS_CLK_SEL_M  (APB_SARADC_TSENS_CLK_SEL_V << APB_SARADC_TSENS_CLK_SEL_S)
#define APB_SARADC_TSENS_CLK_SEL_V  0x00000001U
#define APB_SARADC_TSENS_CLK_SEL_S  15

/** APB_SARADC_CALI_REG register
 *  register description
 */
#define APB_SARADC_CALI_REG (DR_REG_APB_SARADC_BASE + 0x60)
/** APB_SARADC_CALI_CFG : R/W; bitpos: [16:0]; default: 32768;
 *  Need add description
 */
#define APB_SARADC_CALI_CFG    0x0001FFFFU
#define APB_SARADC_CALI_CFG_M  (APB_SARADC_CALI_CFG_V << APB_SARADC_CALI_CFG_S)
#define APB_SARADC_CALI_CFG_V  0x0001FFFFU
#define APB_SARADC_CALI_CFG_S  0

/** APB_SARADC_APB_CTRL_DATE_REG register
 *  register description
 */
#define APB_SARADC_APB_CTRL_DATE_REG (DR_REG_APB_SARADC_BASE + 0x3fc)
/** APB_SARADC_DATE : R/W; bitpos: [31:0]; default: 34632208;
 *  Need add description
 */
#define APB_SARADC_DATE    0xFFFFFFFFU
#define APB_SARADC_DATE_M  (APB_SARADC_DATE_V << APB_SARADC_DATE_S)
#define APB_SARADC_DATE_V  0xFFFFFFFFU
#define APB_SARADC_DATE_S  0

#ifdef __cplusplus
}
#endif
